uhnp/src/Reports/ХодСверкиВГО/ХодСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ХодСверкиВГО</name>
</mdclass:Report>

uhnp/src/InformationRegisters/ИнформацияСверкиВГОПостоянная/ИнформацияСверкиВГОПостоянная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияСверкиВГОПостоянная</name>
  <resources>
    <name>ДоговорыОтправителя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорыПолучателя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтправителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолучателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОтправителяГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолучателяГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхожденияГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <comment>Организация отправитель</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <comment>Организация получатель</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделВГО</name>
    <type>
      <types>CatalogRef.РазделыСверкиВГО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопАналитикаРасхождения</name>
    <type>
      <types>CatalogRef.ДопАналитикаРасхожденийВГО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СверкаВГОЗакрыта/СверкаВГОЗакрыта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СверкаВГОЗакрыта</name>
  <dimensions>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделСверкиВГО</name>
    <type>
      <types>CatalogRef.РазделыСверкиВГО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИнформацияСверкиВГО/ИнформацияСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияСверкиВГО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеСверкиВГО</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтправителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолучателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметКомментирования</name>
    <type>
      <types>CatalogRef.ПредметыКомментирования</types>
    </type>
  </resources>
  <resources>
    <name>Принудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвторУрегулирования</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаСпора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершенияСпора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АвторСпора</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтправителяГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолучателяГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхожденияГр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаРасхождения</name>
    <type>
      <types>CatalogRef.ПричиныРасхожденийВГО</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПричиныРасхождения</name>
    <type>
      <types>EnumRef.СтороныСверкиВГО</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ТрансформационнаяКорректировка</name>
    <type>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <comment>Организация отправитель</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <comment>Организация получатель</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделВГО</name>
    <type>
      <types>CatalogRef.РазделыСверкиВГО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопАналитикаРасхождения</name>
    <type>
      <types>CatalogRef.ДопАналитикаРасхожденийВГО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияДопАналитикРасхожденийВГО/ЗначенияДопАналитикРасхожденийВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДопАналитикРасхожденийВГО</name>
  <dimensions>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделВГО</name>
    <type>
      <types>CatalogRef.РазделыСверкиВГО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <comment>Значение реквизита</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <comment>Тип доп. реквизита</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопАналитикаРасхождения</name>
    <type>
      <types>CatalogRef.ДопАналитикаРасхожденийВГО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УниверсальныеКомментарии/УниверсальныеКомментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УниверсальныеКомментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПакетФайлов</name>
    <type>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметКомментирования</name>
    <type>
      <types>CatalogRef.ПредметыКомментирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СостояниеСверкиВГО/СостояниеСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеСверкиВГО</name>
  <enumValues>
    <name>НеЗагружен</name>
    <comment>Данные для анализа расхождений не загружены. Имеет смысл в разрезе организаций</comment>
  </enumValues>
  <enumValues>
    <name>НеРассчитан</name>
    <comment>Расхождения на расчитаны</comment>
  </enumValues>
  <enumValues>
    <name>Несогласован</name>
  </enumValues>
  <enumValues>
    <name>Спор</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Элиминирован</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтороныСверкиВГО/СтороныСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтороныСверкиВГО</name>
  <enumValues>
    <name>Кредитор</name>
    <comment>Организация-кредитор (отправитель)</comment>
  </enumValues>
  <enumValues>
    <name>Дебитор</name>
    <comment>Организация-дебитор (получатель)</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ДопАналитикаРасхожденийВГО/ДопАналитикаРасхожденийВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДопАналитикаРасхожденийВГО</name>
  <owners>Catalog.Периоды</owners>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияРеквизитов</name>
    <attributes>
      <name>НомерРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Reports/ХодСверкиВГО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - Структура -
//       
//       * ФормироватьСразу - Булево - Значение по умолчанию для флажка "Формировать сразу".
//           Когда флажок включен, то отчет будет формироваться:
//             - После открытия;
//             - После выбора пользовательских настроек;
//             - После выбора другого варианта отчета.
//       
//       * ВыводитьСуммуВыделенныхЯчеек - Булево - Если Истина, то в отчете будет выводиться поле автосуммы.
//       
//       * СоответствиеПериодичностиПараметров - Соответствие - Ограничение списка выбора полей "СтандартныйПериод".
//           ** Ключ - ПараметрКомпоновкиДанных - Имя параметра отчета, к которому применятся ограничения.
//           ** Значение - ПеречислениеСсылка.ДоступныеПериодыОтчета - Ограничение периода отчета "снизу".
//       
//       * Печать - Структура - Параметры печати табличного документа "по умолчанию".
//           ** ПолеСверху - Число - Отступ сверху при печати (в миллиметрах).
//           ** ПолеСлева  - Число - Отступ слева  при печати (в миллиметрах).
//           ** ПолеСнизу  - Число - Отступ снизу  при печати (в миллиметрах).
//           ** ПолеСправа - Число - Отступ справа при печати (в миллиметрах).
//           ** ОриентацияСтраницы - ОриентацияСтраницы - "Портрет" или "Ландшафт".
//           ** АвтоМасштаб - Булево - Автоматически подгонять масштаб под размер страницы.
//           ** МасштабПечати - Число - Масштаб изображения (в процентах).
//       
//       * События - Структура - События, для которых определены обработчики в модуле объекта отчета.
//           
//           ** ПриСозданииНаСервере - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   Отказ - Передается из параметров обработчика "как есть".
//               //   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//               //
//               // См. также:
//               //   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//               //
//               // Пример 1 - Добавление команды с обработчиком в ОтчетыКлиентПереопределяемый.ОбработчикКоманды:
//               //	Команда = Форма.Команды.Добавить("МояОсобеннаяКоманда");
//               //	Команда.Действие  = "Подключаемый_Команда";
//               //	Команда.Заголовок = НСтр("ru = 'Моя команда...'");
//               //	
//               //	Кнопка = Форма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), Форма.Элементы.<ИмяПодменю>);
//               //	Кнопка.ИмяКоманды = Команда.Имя;
//               //	
//               //	Форма.ПостоянныеКоманды.Добавить(КомандаСоздать.Имя);
//               //
//               Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПередЗагрузкойВариантаНаСервере - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//               //
//               // См. также:
//               //   "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//               //
//               Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПриЗагрузкеВариантаНаСервере - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   НовыеНастройкиКД - НастройкиКомпоновкиДанных - Настройки для загрузки в компоновщик настроек.
//               //
//               // См. также:
//               //   "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//               //
//               Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПриЗагрузкеПользовательскихНастроекНаСервере - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных -
//               //       Пользовательские настройки для загрузки в компоновщик настроек.
//               //
//               // См. также:
//               //   "Расширение управляемой формы для отчета.ПриЗагрузкеПользовательскихНастроекНаСервере"
//               //    в синтакс-помощнике.
//               //
//               Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПередЗаполнениемПанелиБыстрыхНастроек - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается до перезаполнения панели настроек формы отчета.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   ПараметрыЗаполнения - Структура - Параметры, которые будут загружены в отчет.
//               //
//               Процедура ПередЗаполнениемПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПослеЗаполненияПанелиБыстрыхНастроек - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается после перезаполнения панели настроек формы отчета.
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма - Форма отчета.
//               //   ПараметрыЗаполнения - Структура - Параметры, которые будут загружены в отчет.
//               //
//               Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** КонтекстныйВызовСервера - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Обработчик контекстного вызова сервера.
//               //   Позволяет выполнить контекстный вызов сервера когда это требуется из клиентского общего модуля.
//               //   Например, из ОтчетыКлиентПереопределяемый.ОбработчикКоманды().
//               //
//               // Параметры:
//               //   Форма  - УправляемаяФорма
//               //   Ключ      - Строка    - Ключ операции, которую необходимо выполнить в контекстном вызове.
//               //   Параметры - Структура - Параметры вызова сервера.
//               //   Результат - Структура - Результат работы сервера, возвращается на клиент.
//               //
//               // См. также:
//               //   ОбщаяФорма.ФормаОтчета.ВыполнитьКонтекстныйВызовСервера().
//               //
//               Процедура КонтекстныйВызовСервера(Форма, Ключ, Параметры, Результат) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ПриОпределенииПараметровВыбора - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Вызывается в форме отчета перед выводом настройки.
//               //   Подробнее - см. ОтчетыПереопределяемый.ПриОпределенииПараметровВыбора().
//               //
//               Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//           
//           ** ДополнитьСвязиОбъектовМетаданных - Булево - Если Истина, то в модуле объекта отчета
//               следует определить обработчик события по шаблону:
//               
//               // Дополнительные связи настроек этого отчета.
//               //   Подробнее - см. ОтчетыПереопределяемый.ДополнитьСвязиОбъектовМетаданных().
//               //
//               Процедура ДополнитьСвязиОбъектовМетаданных(СвязиОбъектовМетаданных) Экспорт
//               	// Обработка события.
//               КонецПроцедуры
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
		
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;//при изменении счета - изменим наименования субконто
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Новый Массив;
	
	//При изменении Период, Сценарий - ДопАналитики в полях
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров.Добавить(Новый ПараметрКомпоновкиДанных("ПериодСценария"));
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров.Добавить(Новый ПараметрКомпоновкиДанных("Сценарий"));
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   Настройки - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Пример:
//  // Компоновщик отчета инициализируется на основании схемы из общих макетов:
//	Если КлючСхемы <> "1" Тогда
//		КлючСхемы = "1";
//		СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//	КонецЕсли;
//
//  // Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//		ИмяОбъектаМетаданных = "";
//		Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//			Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//				ИмяПараметра = Строка(ЭлементКД.Параметр);
//				Если ИмяПараметра = "ОбъектМетаданных" Тогда
//					ИмяОбъектаМетаданных = ЭлементКД.Значение;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		Если КлючСхемы <> ИмяОбъектаМетаданных Тогда
//			КлючСхемы = ИмяОбъектаМетаданных;
//			СхемаКД = Новый СхемаКомпоновкиДанных;
//			// Наполнение схемы...
//			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, Настройки, ПользовательскиеНастройки) Экспорт
	
	Если Настройки = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	НоваяСКД = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ПодготовитьДопАналитикиВГО(НоваяСКД, Истина);
	ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, НоваяСКД, КлючСхемы);
		
КонецПроцедуры

// Вызывается после определения свойств элементов формы, связанных с пользовательскими настройками.
// См. ОтчетыСервер.СвойстваЭлементовФормыНастроек()
// Позволяет переопределить свойства, для целей персонализации отчета.
//
// Параметры:
//  ТипФормы - ТипФормыОтчета - см. Синтакс-помощник.
//  СвойстваЭлементов - Структура - см. ОтчетыСервер.СвойстваЭлементовФормыНастроек().
//  ПользовательскиеНастройки - КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных - элементы актуальных
//                              пользовательских настроек, влияющих на создание связанных элементов формы.
//
Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЕстьРасчет = ОбщегоНазначенияПовтИспУХ.РассчитыватьРасхожденияПорталаВГО();
	Если ЕстьРасчет Тогда
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса_СверкаЕстьРасчет();
		Возврат;
	КонецЕсли;
	
	ПодготовитьДопАналитикиВГО(СхемаКомпоновкиДанных, Ложь);//ДопАналитики удалились
	//КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);//ДопАналитики дб доступны в КН
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	ИменаГруппировок = СтрСоединить(ТиповыеОтчетыУХ.ПолучитьПоляГруппировок(КомпоновщикНастроек).ВыгрузитьЗначения(), ",");
	
	Отбор = Новый Структура("ПериодСценария, Сценарий, ПоВерсии, ИменаГруппировок, ИменаОтборов");
	Отбор.Вставить("ПериодСценария",	ТиповыеОтчетыУХ.ПолучитьЗначениеПараметра(НастройкиСКД, "ПериодСценария") );
	Отбор.Вставить("Сценарий", 			ТиповыеОтчетыУХ.ПолучитьЗначениеПараметра(НастройкиСКД, "Сценарий") );
	Отбор.Вставить("ПоВерсии", 			СтрНайти(ИменаГруппировок, "Регистратор") > 0 );
	Отбор.Вставить("ИменаГруппировок", 	ИменаГруппировок);
	Отбор.Вставить("ИменаОтборов", 		СтрСоединить(ТиповыеОтчетыУХ.ПолучитьПоляОтборов(НастройкиСКД.Отбор), ","));
	
	ТекстО = СверкаВГОУХ.ТекстЗапроса_ОтборВГО(НастройкиСКД, "Организация");
	ТекстК = СверкаВГОУХ.ТекстЗапроса_ОтборВГО(НастройкиСКД, "Контрагент");
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СверкаВГОУХ.ТекстЗапроса_ОтчетВГО(Отбор,, ТекстО, ТекстК);
	
КонецПроцедуры

Процедура ПодготовитьДопАналитикиВГО(НоваяСКД, ДополнитьЗапрос = Ложь)
	
	ндВГО = НоваяСКД.НаборыДанных.Найти("СверкаВГО");
	
	ПолеИсточник = ндВГО.Поля.Найти("АналитикиВГО.Аналитика1");
	ДопАналитикиВГО = Новый Массив;
	НомерУникальности = 1;
	
	Запрос = Новый Запрос(СверкаВГОУХ.ТекстЗапроса_ВозможныеДопАналитики());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Поле = ндВГО.Поля.Добавить(ТипЗнч(ПолеИсточник));
		ЗаполнитьЗначенияСвойств(Поле, ПолеИсточник);
		
		Поле.Поле = СтрШаблон("%1_%2",  Выборка.Имя, НомерУникальности);
		Поле.ПутьКДанным = "АналитикиВГО." + Поле.Поле;
		Поле.Заголовок = Выборка.Имя + НСтр("ru = ' (Аналитика ВГО)'");
		Поле.ТипЗначения = Выборка.ВидАналитики.ТипЗначения;
		НомерУникальности = НомерУникальности + 1;
		
		Если Поле.ТипЗначения.Типы().Количество() = 1 Тогда
			ИмяТипа = Метаданные.НайтиПоТипу(Поле.ТипЗначения.Типы()[0]).ПолноеИмя();
			ДопАналитикиВГО.Добавить(СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка) КАК %2", ИмяТипа, Поле.Поле));
		Иначе 
			ДопАналитикиВГО.Добавить("т.Аналитика1 КАК " + Поле.Поле);//все типы
		КонецЕсли;
		
	КонецЦикла;
	ДопАналитикиВГО.Добавить("ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
	
	Если ДополнитьЗапрос Тогда
	
		ТекстДопАналитикиВГО = СтрСоединить(ДопАналитикиВГО, ", ");
		ндВГО.Запрос = СтрЗаменить(ндВГО.Запрос, "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)", ТекстДопАналитикиВГО);
	
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапроса_СверкаЕстьРасчет()

	Возврат
	"ВЫБРАТЬ
	|	&Дата КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеСверкиВГО.Спор) КАК Состояние
	|{ГДЕ
	|	(ЗНАЧЕНИЕ(Перечисление.СостояниеСверкиВГО.Спор)).* КАК Состояние}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнформацияСверкиВГОПостоянная.Отправитель КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СтороныСверкиВГО.Кредитор) КАК СторонаСверки,
	|	ИнформацияСверкиВГОПостоянная.Получатель КАК Контрагент,
	|	ИнформацияСверкиВГОПостоянная.РазделВГО КАК РазделВГО,
	|	ИнформацияСверкиВГОПостоянная.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ИнформацияСверкиВГОПостоянная.СуммаРасхождения КАК РасхожденийОсталосьУрегулировать,
	|	ИнформацияСверкиВГОПостоянная.СуммаОтправителя КАК СуммаОрганизации,
	|	ИнформацияСверкиВГОПостоянная.СуммаПолучателя КАК СуммаКонтрагента,
	|	ИнформацияСверкиВГОПостоянная.СуммаРасхожденияГр КАК РасхожденийОсталосьУрегулироватьГр,
	|	ВЫБОР
	|		КОГДА СверкаВГОЗакрыта.ПериодСценария ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СверкаЗакрыта,
	|	ИнформацияСверкиВГОПостоянная.СуммаОтправителяГр КАК СуммаОрганизацииГр,
	|	ИнформацияСверкиВГОПостоянная.СуммаПолучателяГр КАК СуммаКонтрагентаГр,
	|	ИнформацияСверкиВГОПостоянная.ДопАналитикаРасхождения КАК ДопАналитикаРасхождения,
	|	ИнформацияСверкиВГОСрезПоследних.ПредметКомментирования КАК ПредметКомментирования,
	|	ИнформацияСверкиВГОСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ Расхождения
	|ИЗ
	|	РегистрСведений.ИнформацияСверкиВГОПостоянная КАК ИнформацияСверкиВГОПостоянная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СверкаВГОЗакрыта КАК СверкаВГОЗакрыта
	|		ПО ИнформацияСверкиВГОПостоянная.ПериодСценария = СверкаВГОЗакрыта.ПериодСценария
	|			И ИнформацияСверкиВГОПостоянная.Сценарий = СверкаВГОЗакрыта.Сценарий
	|			И ИнформацияСверкиВГОПостоянная.Этап = СверкаВГОЗакрыта.Этап
	|			И ИнформацияСверкиВГОПостоянная.Отправитель = СверкаВГОЗакрыта.Отправитель
	|			И ИнформацияСверкиВГОПостоянная.Получатель = СверкаВГОЗакрыта.Получатель
	|			И ИнформацияСверкиВГОПостоянная.РазделВГО = СверкаВГОЗакрыта.РазделСверкиВГО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияСверкиВГО.СрезПоследних КАК ИнформацияСверкиВГОСрезПоследних
	|		ПО ИнформацияСверкиВГОПостоянная.ПериодСценария = ИнформацияСверкиВГОСрезПоследних.ПериодСценария
	|			И ИнформацияСверкиВГОПостоянная.Сценарий = ИнформацияСверкиВГОСрезПоследних.Сценарий
	|			И ИнформацияСверкиВГОПостоянная.Этап = ИнформацияСверкиВГОСрезПоследних.Этап
	|			И ИнформацияСверкиВГОПостоянная.Отправитель = ИнформацияСверкиВГОСрезПоследних.Отправитель
	|			И ИнформацияСверкиВГОПостоянная.Получатель = ИнформацияСверкиВГОСрезПоследних.Получатель
	|			И ИнформацияСверкиВГОПостоянная.РазделВГО = ИнформацияСверкиВГОСрезПоследних.РазделВГО
	|			И ИнформацияСверкиВГОПостоянная.ВалютаВзаиморасчетов = ИнформацияСверкиВГОСрезПоследних.ВалютаВзаиморасчетов
	|			И ИнформацияСверкиВГОПостоянная.ДопАналитикаРасхождения = ИнформацияСверкиВГОСрезПоследних.ДопАналитикаРасхождения
	|ГДЕ
	|	ИнформацияСверкиВГОПостоянная.ПериодСценария В ИЕРАРХИИ(&ПериодСценария)
	|	И ИнформацияСверкиВГОПостоянная.Сценарий = &Сценарий
	|{ГДЕ
	|	ИнформацияСверкиВГОПостоянная.ПериодСценария,
	|	ИнформацияСверкиВГОПостоянная.Сценарий}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнформацияСверкиВГОПостоянная.Получатель,
	|	ЗНАЧЕНИЕ(Перечисление.СтороныСверкиВГО.Дебитор),
	|	ИнформацияСверкиВГОПостоянная.Отправитель,
	|	ИнформацияСверкиВГОПостоянная.РазделВГО,
	|	ИнформацияСверкиВГОПостоянная.ВалютаВзаиморасчетов,
	|	ИнформацияСверкиВГОПостоянная.СуммаРасхождения,
	|	ИнформацияСверкиВГОПостоянная.СуммаПолучателя,
	|	ИнформацияСверкиВГОПостоянная.СуммаОтправителя,
	|	ИнформацияСверкиВГОПостоянная.СуммаРасхожденияГр,
	|	ВЫБОР
	|		КОГДА СверкаВГОЗакрыта.ПериодСценария ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ИнформацияСверкиВГОПостоянная.СуммаПолучателяГр,
	|	ИнформацияСверкиВГОПостоянная.СуммаОтправителяГр,
	|	ИнформацияСверкиВГОПостоянная.ДопАналитикаРасхождения,
	|	ИнформацияСверкиВГОСрезПоследних.ПредметКомментирования,
	|	ИнформацияСверкиВГОСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.ИнформацияСверкиВГОПостоянная КАК ИнформацияСверкиВГОПостоянная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СверкаВГОЗакрыта КАК СверкаВГОЗакрыта
	|		ПО ИнформацияСверкиВГОПостоянная.ПериодСценария = СверкаВГОЗакрыта.ПериодСценария
	|			И ИнформацияСверкиВГОПостоянная.Сценарий = СверкаВГОЗакрыта.Сценарий
	|			И ИнформацияСверкиВГОПостоянная.Этап = СверкаВГОЗакрыта.Этап
	|			И ИнформацияСверкиВГОПостоянная.Отправитель = СверкаВГОЗакрыта.Отправитель
	|			И ИнформацияСверкиВГОПостоянная.Получатель = СверкаВГОЗакрыта.Получатель
	|			И ИнформацияСверкиВГОПостоянная.РазделВГО = СверкаВГОЗакрыта.РазделСверкиВГО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияСверкиВГО.СрезПоследних КАК ИнформацияСверкиВГОСрезПоследних
	|		ПО ИнформацияСверкиВГОПостоянная.ПериодСценария = ИнформацияСверкиВГОСрезПоследних.ПериодСценария
	|			И ИнформацияСверкиВГОПостоянная.Сценарий = ИнформацияСверкиВГОСрезПоследних.Сценарий
	|			И ИнформацияСверкиВГОПостоянная.Этап = ИнформацияСверкиВГОСрезПоследних.Этап
	|			И ИнформацияСверкиВГОПостоянная.Отправитель = ИнформацияСверкиВГОСрезПоследних.Отправитель
	|			И ИнформацияСверкиВГОПостоянная.Получатель = ИнформацияСверкиВГОСрезПоследних.Получатель
	|			И ИнформацияСверкиВГОПостоянная.РазделВГО = ИнформацияСверкиВГОСрезПоследних.РазделВГО
	|			И ИнформацияСверкиВГОПостоянная.ВалютаВзаиморасчетов = ИнформацияСверкиВГОСрезПоследних.ВалютаВзаиморасчетов
	|			И ИнформацияСверкиВГОПостоянная.ДопАналитикаРасхождения = ИнформацияСверкиВГОСрезПоследних.ДопАналитикаРасхождения
	|ГДЕ
	|	ИнформацияСверкиВГОПостоянная.ПериодСценария В ИЕРАРХИИ(&ПериодСценария)
	|	И ИнформацияСверкиВГОПостоянная.Сценарий = &Сценарий
	|{ГДЕ
	|	ИнформацияСверкиВГОПостоянная.ПериодСценария,
	|	ИнформацияСверкиВГОПостоянная.Сценарий}
	|{ХАРАКТЕРИСТИКИ
	|	ТИП(Справочник.ДопАналитикаРасхожденийВГО)
	|	ВИДЫХАРАКТЕРИСТИК ПланВидовХарактеристик.ВидыСубконтоКорпоративные
	|	ПОЛЕКЛЮЧА Ссылка
	|	ПОЛЕИМЕНИ Наименование
	|	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
	|	ЗНАЧЕНИЯХАРАКТЕРИСТИК РегистрСведений.ЗначенияДопАналитикРасхожденийВГО
	|	ПОЛЕОБЪЕКТА ДопАналитикаРасхождения
	|	ПОЛЕВИДА Реквизит
	|	ПОЛЕЗНАЧЕНИЯ Значение }
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(УниверсальныеКомментарииСрезПоследних.Период) КАК Период,
	|	УниверсальныеКомментарииСрезПоследних.ПредметКомментирования КАК ПредметКомментирования
	|ПОМЕСТИТЬ МаксПериодКомментария
	|ИЗ
	|	Расхождения КАК Расхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УниверсальныеКомментарии.СрезПоследних КАК УниверсальныеКомментарииСрезПоследних
	|		ПО Расхождения.ПредметКомментирования = УниверсальныеКомментарииСрезПоследних.ПредметКомментирования
	|
	|СГРУППИРОВАТЬ ПО
	|	УниверсальныеКомментарииСрезПоследних.ПредметКомментирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расхождения.Организация КАК Организация,
	|	Расхождения.СторонаСверки КАК СторонаСверки,
	|	Расхождения.Контрагент КАК Контрагент,
	|	Расхождения.РазделВГО КАК РазделВГО,
	|	Расхождения.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Расхождения.РасхожденийОсталосьУрегулировать КАК РасхожденийОсталосьУрегулировать,
	|	Расхождения.СуммаОрганизации КАК СуммаОрганизации,
	|	Расхождения.СуммаКонтрагента КАК СуммаКонтрагента,
	|	Расхождения.РасхожденийОсталосьУрегулироватьГр КАК РасхожденийОсталосьУрегулироватьГр,
	|	Расхождения.СверкаЗакрыта КАК СверкаЗакрыта,
	|	Расхождения.СуммаОрганизацииГр КАК СуммаОрганизацииГр,
	|	Расхождения.СуммаКонтрагентаГр КАК СуммаКонтрагентаГр,
	|	Расхождения.ДопАналитикаРасхождения КАК ДопАналитикаРасхождения,
	|	ПОДСТРОКА(УниверсальныеКомментарииСрезПоследних.Комментарий, 0, 300) КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Расхождения.СуммаОрганизацииГр >= 0
	|					ТОГДА Расхождения.СуммаОрганизацииГр
	|				ИНАЧЕ -Расхождения.СуммаОрганизацииГр
	|			КОНЕЦ + ВЫБОР
	|				КОГДА Расхождения.СуммаКонтрагентаГр >= 0
	|					ТОГДА Расхождения.СуммаКонтрагентаГр
	|				ИНАЧЕ -Расхождения.СуммаКонтрагентаГр
	|			КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ (Расхождения.СуммаОрганизацииГр - Расхождения.СуммаКонтрагентаГр) * 200 / ВЫБОР
	|				КОГДА Расхождения.СуммаОрганизацииГр >= 0
	|					ТОГДА Расхождения.СуммаОрганизацииГр
	|				ИНАЧЕ -Расхождения.СуммаОрганизацииГр
	|			КОНЕЦ + ВЫБОР
	|				КОГДА Расхождения.СуммаКонтрагентаГр >= 0
	|					ТОГДА Расхождения.СуммаКонтрагентаГр
	|				ИНАЧЕ -Расхождения.СуммаКонтрагентаГр
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентОсталосьУрегулировать,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Расхождения.СуммаОрганизацииГр >= 0
	|					ТОГДА Расхождения.СуммаОрганизацииГр
	|				ИНАЧЕ -Расхождения.СуммаОрганизацииГр
	|			КОНЕЦ + ВЫБОР
	|				КОГДА Расхождения.СуммаКонтрагентаГр >= 0
	|					ТОГДА Расхождения.СуммаКонтрагентаГр
	|				ИНАЧЕ -Расхождения.СуммаКонтрагентаГр
	|			КОНЕЦ = 0
	|			ТОГДА 0
	|		ИНАЧЕ (Расхождения.СуммаОрганизацииГр - Расхождения.СуммаКонтрагентаГр) * 200 / (ВЫБОР
	|				КОГДА Расхождения.СуммаОрганизацииГр >= 0
	|					ТОГДА Расхождения.СуммаОрганизацииГр
	|				ИНАЧЕ -Расхождения.СуммаОрганизацииГр
	|			КОНЕЦ + ВЫБОР
	|				КОГДА Расхождения.СуммаКонтрагентаГр >= 0
	|					ТОГДА Расхождения.СуммаКонтрагентаГр
	|				ИНАЧЕ -Расхождения.СуммаКонтрагентаГр
	|			КОНЕЦ)
	|	КОНЕЦ - Расхождения.РазделВГО.ПорогСущественности КАК ПроцентОсталосьУрегулироватьБезПорога,
	|	Расхождения.РазделВГО.ПорогСущественности КАК ПорогСущественности,
	|	УниверсальныеКомментарииСрезПоследних.Автор КАК АвторКомментария,
	|	Расхождения.Состояние КАК Состояние
	|ИЗ
	|	Расхождения КАК Расхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксПериодКомментария КАК МаксПериодКомментария
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УниверсальныеКомментарии.СрезПоследних КАК УниверсальныеКомментарииСрезПоследних
	|			ПО МаксПериодКомментария.Период = УниверсальныеКомментарииСрезПоследних.Период
	|				И МаксПериодКомментария.ПредметКомментирования = УниверсальныеКомментарииСрезПоследних.ПредметКомментирования
	|		ПО Расхождения.ПредметКомментирования = МаксПериодКомментария.ПредметКомментирования";
	
КонецФункции

#КонецЕсли
